{
  "title": "Logistic API overview",
  "content": "# Context\nThe Logistic API helps you obtain information about logistic resources including: \n\n* Get Warehouse List\n* Get Subscribed Delivery Options\n* Get Shipping Providers\n* Get Global Warehouse List\n\n\nWhen sellers create/publish products, they may need to:\n\n* Get Warehouse List\n* Get Global Warehouse List\n\nFor more detail, please refer to the [\"Product API\" overview](https://partner.tiktokshop.com/docv2/page/650b23eef1fd3102b93d2326).\n\nWhen sellers fulfill orders, they may need to:\n\n* Get Subscribed Delivery Options\n* Get Shipping Providers\n\nFor more detail, please refer to the [\"Fulfillment API\" overview](https://partner.tiktokshop.com/docv2/page/650b2044f1fd3102b93c9178).\n# Important Concepts\n## Warehouse\nWarehouses are setup by sellers when they create their TikTok Shop account. This is where packages will be sent out from once an order needs to be shipped.\nOne seller can have multiple global warehouses.\nOne seller can have multiple warehouses for one shop.\n![Image](https://p16-arcosite-va.ibyteimg.com/tos-maliva-i-10qhjjqwgv-us/54149c6a76d3475b8f50e2dc02ff442a~tplv-10qhjjqwgv-image.image)\nWhen sellers want to create a global product, they need to clarify inventory based on global warehouses([Get Global Warehouse List API](https://partner.tiktokshop.com/docv2/page/650aa3f0defece02be6e5ffb?external_id=650aa3f0defece02be6e5ffb#Back%20To%20Top)).\nWhen sellers want to publish a global product, they need to clarify inventory based on warehouses.([Get Warehouse List API](https://partner.tiktokshop.com/docv2/page/650aa418defece02be6e66b6))\n## Delivery Option\nA delivery option is a logistic solution which assists sellers to handover goods to customers.\nA delivery option includes a set of shipping providers and shipping services.\nSeller needs to fulfill order under delivery option requirement,  including shipping providers, shipping services, dimension, weight, etc.\nA delivery option is chosen by the buyer, when the buyer places an order on TikTok.   Examples of delivery options include \"Express shipping\" for Seller Shipping, \"Economy Shipping\" for TikTok Shipping, etc.  \nPlease note that Express Shipping for Seller Shipping, and Express Shipping for TikTok Shipping are in fact two different delivery options.\n### Shipping Type\nShipping type is how sellers can ship packages.  It's a property of delivery option.\nTikTok supports multiple shipping types:\n\n* Platform - Sellers connect with shipping providers through TikTok. \n* Seller - Sellers connect with shipping providers their own channels, then upload tracking numbers to TikTok for further tracking.\n\nFor different regions, TikTok provides different services for shipping , including purchasing labels, arranging shipments, etc.\n## Shipping Service( for US )\nA shipping service is a specific logistic service which is provided by one provider.\nDifferent delivery options have different available shipping services.\nExamples of shipping services include  \"USPS Ground\", \"DHL eCommerce SM parcel\".\n## Shipping provider\nShipping providers are providers who provide shipping services. \nDifferent delivery options have different available shipping providers.\nFor orders which use \"seller shipping\" type delivery option, seller needs to update shipping provider and tracking number during fulfillment.\nExamples of shipping providers include \"USPS\", \"DHL eCommerce\".\nImportant tips: \"DHL\" and \"DHL eCommerce\" are two providers.\n\nThe diagram below outlines the relationship between delivery option, shipping provider and shipping service.\n\n![Image](https://p16-arcosite-va.ibyteimg.com/tos-maliva-i-10qhjjqwgv-us/dcefc31a473646bca211ab30380158e2~tplv-10qhjjqwgv-image.image)\n\n# Frequently Asked Questions\n\n* What is the relationship between a seller and a shop?\n\nOne seller can run businesses in multiple regions.\nFor each region, one seller can have one TikTok shop.\n![Image](https://p16-arcosite-va.ibyteimg.com/tos-maliva-i-10qhjjqwgv-us/46c96cf5ec98442894d42cf2814ecf94~tplv-10qhjjqwgv-image.image)\n\n* What is the relationship between a global warehouse and a warehouse?\n\nWhen there is a global warehouse, for every region, there is a warehouse which actually refers to the global warehouse.\n\n* What is the relationship between a warehouse and a deliveryOption?\n\nOne warehouse can subscribe multiple delivery options.\n![Image](https://p16-arcosite-va.ibyteimg.com/tos-maliva-i-10qhjjqwgv-us/5574a789943f4a55b9bec9904dad5324~tplv-10qhjjqwgv-image.image)\n\n* What is the difference between different delivery options?\n\nThere are several pieces of fulfillment info in an order's Order Detail:\n\n* Delivery option id\n* Fulfillment type: means goods will be shipped from TikTok warehouse or seller warehouse \n      * FULFILLMENT_BY_TIKTOK\n      * FULFILLMENT_BY_SELLER\n* Ship type:   means package will purchase label through TikTok or through seller's own channel.\n      * TikTok\n      * Seller\n\nFor fulfillment type - FULFILLMENT_BY_TIKTOK, TikTok will automatically process the order on behalf of the seller. The seller does not need to manage the fulfillment process. \nFor fulfillment type - FULFILLMENT_BY_SELLER, sellers need to use Fulfillment API to process order.\nFor more detail of fulfillment flows, please refer to [Fulfillment API overview](https://partner.tiktokshop.com/docv2/page/650b2044f1fd3102b93c9178).\n\n",
  "update_time": "1744285934",
  "view_count": 0,
  "prev_document_id": "670d587d6921310398a3af3d",
  "prev_document_path": "search-goods-info-202409",
  "next_document_id": "650aa418defece02be6e66b6",
  "next_document_path": "get-warehouse-list-202309",
  "is_api_doc": true,
  "document_id": "650b1e47defece02be7e755e",
  "doc_type": 10,
  "keywords": [
    {
      "keyword": "",
      "font_color": "#141414",
      "background_color": "#E6E6E6"
    }
  ]
}