{
  "title": "Seller API overview",
  "content": "\n# Context\nUse the Seller API to retrieve to the seller's active shop(s) or check if the seller has permission to manage global products. Our APIs help Selling Partner's extend their services and grow seller businesses on TikTok Shop at scale.\nThis API is currently commonly used by global sellers to check whether the store has the ability to list global products.\nThe Seller API helps allows you to programmatically GET an active shop(s) List, and Query whether you have the permission to list global products.\n# Important Concepts\n\n* Seller(Object):  In the TikTok Shop platform, the seller object represents an entity or account that represents a seller or merchant who offers products or services for sale on the platform. It typically contains information related to the seller's identity, profile, and settings.  \n* **Seller-shop relationship**\n\n![Image](https://p16-arcosite-va.ibyteimg.com/tos-maliva-i-10qhjjqwgv-us/45cea3825dad428088ac4008cd7f2a77~tplv-10qhjjqwgv-image.image)\n\n\n* **Shop states**\n\nThe shop state mechanism in an e-commerce platform refers to the system used to manage and maintain the current state or status of a seller's shop or store on the platform. It involves tracking various aspects of the shop's operations, availability, and visibility to both sellers and buyers. \n![Image](https://p16-arcosite-va.ibyteimg.com/tos-maliva-i-10qhjjqwgv-us/42c408fef3fc4d98bb2f37b67afcb945~tplv-10qhjjqwgv-image.image)\n\n* **Shop region**\n\nThe shop region in an e-commerce platform refers to the geographical or jurisdictional area where a seller's shop operates or targets its customers. It helps determine the availability, shipping options, and other localized aspects of the shop's services. \n\n# TikTok Shop Marketplace Policies\nAs a Marketplace, TikTok Shop imposes certain policies on sellers to the benefit of both buyers and sellers.\n\n* We support global sellers opening 1 shop for each target selling country.\n* For local sellers, since the target sales place can only be sold locally, a seller can only open and operate 1 local shop. \n*  Every seller has a unique shop code and seller ID generated by the platform. Both seller code and ID cannot be modified once created.\n* Every seller needs to complete the registration and submit the onboarding information, after approved by onboarding moderation, the seller can start business in the TikTok Shop, which means the shop state is active. \n\n\n# Frequently Asked Questions\n\n* What are the different types of sellers? \n   * **Local sellers**: Sellers who sell products within the same country as their registered business entity, and are not involved in import and export trades.\n   *  **Global sellers**: Sellers who sell products to multiple countries beyond the country of their registered business entity. They engage in cross-border trade activities, including settlement and logistics.\n   *  **Intra-EU sellers**: Sellers whose business entity is registered in one EU country and who sell products to customers in other EU countries.\n\n\n\n* What's a Global product? \n   * Global products are applicable to the **global sellers** and **intra-EU sellers** only, local sellers cannot use this feature. In order to improve the efficiency in managing multi-shop products, sellers can manage product information centrally via this global product and apply changes to the product in multiple markets. After uploading global products, sellers can publish them to shops in multiple markets with just one click.\n\n\n",
  "update_time": "1748320213",
  "view_count": 0,
  "prev_document_id": "650aa1eadefece02be6e224a",
  "prev_document_path": "delete-shop-webhook-202309",
  "next_document_id": "650a69e24a0bb702c067291c",
  "next_document_path": "get-active-shops-202309",
  "is_api_doc": true,
  "document_id": "650b1f2ff1fd3102b93c6d3d",
  "doc_type": 10,
  "keywords": [
    {
      "keyword": "",
      "font_color": "#141414",
      "background_color": "#E6E6E6"
    }
  ]
}